cases/Day-2/waterOilEvaporationHeatFlux/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.gas   1
    volScalarFieldValue alpha.liquid 0
    volScalarFieldValue alpha.oil 0
);

regions
(
    boxToCell
    {
        box (-1 -1 -1) (1 1 0.06);
        fieldValues
        (
            volScalarFieldValue alpha.liquid 1
            volScalarFieldValue alpha.gas    0
            volScalarFieldValue alpha.oil    0
        );
    }

    boxToCell
    {
        box (-1 -1 0.06) (1 1 0.089);
        fieldValues
        (
            volScalarFieldValue alpha.oil 1
            volScalarFieldValue alpha.gas    0
            volScalarFieldValue alpha.liquid    0
        );
    }
);


// ************************************************************************* //
